In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder

# Load dataset baru (separator harus ;)
df = pd.read_csv('dataset_pinjaman_online_converted.csv', sep=';')

print("5 Data Awal:")
df.head()

5 Data Awal:

,ID_Pelanggan,Umur,Pendapatan,JumlahPinjaman,LamaBekerja,Pendidikan,StatusPerkawinan,Pekerjaan,TujuanPinjaman,KodeKota,RiwayatPinjaman,StatusPinjaman
0,CUST001,56,6350000.0,9070000.0,0,S2,Lajang,Wirausaha,Modal Usaha,K72,Baik,Layak
1,CUST002,46,10300000.0,7800000.0,3,D3,Cerai,PNS,Kesehatan,K23,Baik,Tidak Layak
2,CUST003,32,9480000.0,17230000.0,13,S1,Cerai,NaN,Pendidikan,K46,Baik,Layak
3,CUST004,25,9440000.0,10980000.0,0,Tidak Sekolah,Lajang,NaN,Modal Usaha,K72,Baik,Tidak Layak
4,CUST005,38,10920000.0,15160000.0,13,S1,Lajang,Lainnya,Modal Usaha,K08,Baik,Tidak Layak

In [2]:
print(df.info())
print(df.describe(include='all'))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID_Pelanggan      500 non-null    object
 1   Umur              500 non-null    int64
 2   Pendapatan        475 non-null    float64
 3   JumlahPinjaman    476 non-null    float64
 4   LamaBekerja       500 non-null    int64
 5   Pendidikan        475 non-null    object
 6   StatusPerkawinan  500 non-null    object
 7   Pekerjaan         475 non-null    object
 8   TujuanPinjaman    500 non-null    object
 9   KodeKota          500 non-null    object
 10  RiwayatPinjaman   500 non-null    object
 11  StatusPinjaman    500 non-null    object
dtypes: float64(2), int64(2), object(8)
memory usage: 47.0+ KB
None
       ID_Pelanggan        Umur    Pendapatan  JumlahPinjaman  LamaBekerja  \
count           500  500.000000  4.750000e+02    4.760000e+02   500.000000
unique          500         NaN           NaN             NaN          NaN
top         CUST500         NaN           NaN             NaN          NaN
freq              1         NaN           NaN             NaN          NaN
mean            NaN   39.326000  7.557575e+06    1.167505e+07     9.728000
std             NaN   12.200386  4.978891e+06    9.054015e+06     5.816673
min             NaN   18.000000 -1.090000e+06   -4.480000e+06     0.000000
25%             NaN   29.000000  5.090000e+06    7.237500e+06     5.000000
50%             NaN   41.000000  7.070000e+06    1.072000e+07     9.500000
75%             NaN   50.000000  9.055000e+06    1.397250e+07    15.000000
max             NaN   59.000000  3.492979e+07    6.395735e+07    19.000000

       Pendidikan StatusPerkawinan Pekerjaan  TujuanPinjaman KodeKota  \
count         475              500       475             500      500
unique          5                3         5               5       79
top            S1          Menikah  Karyawan  Renovasi Rumah      K17
freq          110              170       109             111       11
mean          NaN              NaN       NaN             NaN      NaN
std           NaN              NaN       NaN             NaN      NaN
min           NaN              NaN       NaN             NaN      NaN
25%           NaN              NaN       NaN             NaN      NaN
50%           NaN              NaN       NaN             NaN      NaN
75%           NaN              NaN       NaN             NaN      NaN
max           NaN              NaN       NaN             NaN      NaN

       RiwayatPinjaman StatusPinjaman
count              500            500
unique               2              2
top               Baik          Layak
freq               406            342
mean               NaN            NaN
std                NaN            NaN
min                NaN            NaN
25%                NaN            NaN
50%                NaN            NaN
75%                NaN            NaN
max                NaN            NaN

In [3]:
print("Missing value tiap kolom:")
print(df.isna().sum())

Missing value tiap kolom:
ID_Pelanggan         0
Umur                 0
Pendapatan          25
JumlahPinjaman      24
LamaBekerja          0
Pendidikan          25
StatusPerkawinan     0
Pekerjaan           25
TujuanPinjaman       0
KodeKota             0
RiwayatPinjaman      0
StatusPinjaman       0
dtype: int64

In [4]:
# Kolom numerik → isi dengan median
num_cols = ['Umur', 'Pendapatan', 'JumlahPinjaman', 'LamaBekerja']
for col in num_cols:
    df[col] = df[col].fillna(df[col].median())

# Kolom kategori → isi mode
cat_cols = ['Pendidikan', 'StatusPerkawinan', 'Pekerjaan', 
            'TujuanPinjaman', 'KodeKota', 'RiwayatPinjaman']
for col in cat_cols:
    df[col] = df[col].fillna(df[col].mode()[0])

In [5]:
le = LabelEncoder()

encode_cols = [
    'Pendidikan',
    'StatusPerkawinan',
    'Pekerjaan',
    'TujuanPinjaman',
    'KodeKota',
    'RiwayatPinjaman',
    'StatusPinjaman'
]

for col in encode_cols:
    df[col] = le.fit_transform(df[col])

In [6]:
df_clean = df.drop(columns=['ID_Pelanggan'])
df_clean.head()

,Umur,Pendapatan,JumlahPinjaman,LamaBekerja,Pendidikan,StatusPerkawinan,Pekerjaan,TujuanPinjaman,KodeKota,RiwayatPinjaman,StatusPinjaman
0,56,6350000.0,9070000.0,0,2,1,4,2,71,0,0
1,46,10300000.0,7800000.0,3,0,0,3,0,22,0,1
2,32,9480000.0,17230000.0,13,1,0,1,3,45,0,0
3,25,9440000.0,10980000.0,0,4,1,1,2,71,0,1
4,38,10920000.0,15160000.0,13,1,1,2,2,7,0,1

In [7]:
X = df_clean.drop(columns=['StatusPinjaman'])
y = df_clean['StatusPinjaman']

X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size=0.3, random_state=42
)

print("Ukuran Train:", X_train.shape)
print("Ukuran Test :", X_test.shape)

Ukuran Train: (350, 10)
Ukuran Test : (150, 10)

In [8]:
train_df = X_train.copy()
train_df['StatusPinjaman'] = y_train

test_df = X_test.copy()
test_df['StatusPinjaman'] = y_test

train_df.to_csv("data_train_preprocessed.csv", index=False)
test_df.to_csv("data_test_preprocessed.csv", index=False)

print("Dataset berhasil disimpan:")
print("- data_train_preprocessed.csv")
print("- data_test_preprocessed.csv")

Dataset berhasil disimpan:
- data_train_preprocessed.csv
- data_test_preprocessed.csv